Revit 2027 API
MEPBuildingConstructionSet.Contains Method
Tests for the existence of a MEPBuildingConstruction within the set.
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public virtual bool Contains(
	MEPBuildingConstruction item
)
Public Overridable Function Contains (
	item As MEPBuildingConstruction
) As Boolean
public:
virtual bool Contains(
	MEPBuildingConstruction^ item
)
abstract Contains :
        item : MEPBuildingConstruction -> bool
override Contains :
        item : MEPBuildingConstruction -> bool
Parameters
item MEPBuildingConstruction
The MEPBuildingConstruction to be searched for.
Return Value
Boolean
The Contains method returns True if the MEPBuildingConstruction is within the set, otherwise False.
See Also
Reference
MEPBuildingConstructionSet Class
Autodesk.Revit.DB.Mechanical Namespace